import asyncio
import logging
from google import genai
from config import GEMINI_API_KEY

gemini_client = genai.Client(api_key=GEMINI_API_KEY)


async def generate_consultation_response(user_query: str, context: str, history_context: str) -> str:
    """Генерує відповідь на основі знайденого контексту."""

    system_instruction = f"""
    Ти — цифровий консультант приймальної комісії ТФК ЛНТУ.

    Твоє завдання — відповідати ВИКЛЮЧНО на основі наданого контексту.

    Правила:

    1. Використовуй тільки інформацію з контексту.
    Не додавай власних знань, припущень або інформації з пам'яті моделі.

    2. Якщо у контексті є достатньо інформації — дай відповідь.

    3. Якщо у контексті є лише частина потрібної інформації — відповідай тільки тим, що є у контексті. Не вигадуй відсутні деталі.

    4. Якщо відповіді у контексті немає зовсім, відповідай:
    "На жаль, не маю цієї інформації. Зателефонуйте до приймальної комісії."

    5. Якщо користувач не вказав рівень освіти (Кваліфікований робітник чи Фаховий молодший бакалавр), а відповідь залежить від цього, надай інформацію по фаховому молодшому бакалавру
    але уточни що ці інформаці відноситься до Фахового молодшого бакалавра.

    6. Відповідай максимально коротко.
    Не використовуй вступів, привітань або пояснень, якщо вони не потрібні.

    7. Не перелічуй інформацію, про яку користувач не запитував.

    8. Не використовуй символ "_" та складні таблиці.
    9. Якщо контекст містить інформацію, що дозволяє відповісти на запитання повністю або частково, використай її.
    
    10. Якщо користувач використовує загальне або розмовне слово (наприклад: програміст, айті, автомобілі, електрик, дизайнер), знайди у контексті всі спеціальності або професії, які відповідають цьому поняттю, і перелічи їх.

    Не обмежуйся лише точним збігом слів. Використовуй зміст і синоніми, якщо вони присутні у контексті.
 
    Контекст:
    {context}
    """

    full_prompt = f"{system_instruction}\n{history_context}\nПоточне запитання абітурієнта: {user_query}\nВідповідь:"
    print(full_prompt)
    try:
        response = await asyncio.to_thread(
            gemini_client.models.generate_content,
            model='gemma-4-26b-a4b-it',  # Збережено вашу модель
            contents=full_prompt
        )


        return response.text
    except Exception as e:
        logging.error(f"Gemini API Error: {e}")
        raise e