


START_ANSWER = ('Привіт, якщо зареєструєшся через /register я буду сповіщати тебе про екзамени.'
                ' Задавай питання розкажу все що знаю про вступ, але можу трошки довго думати! ')


SPECIALITY = {
    "Комп'ютерна інженерія": 'KI',
    "Дизайн": 'DZ',
    "Менеджмент": 'MD',
    "Інформаційні системи та технології": 'ICT',
    "Електроенергетика": 'ET',
    "Автомобільний транспорт": 'AT',
    "Кібербезпека": 'KB',
    "Транспортні технології": 'TT',
    "Підприємництво": 'PT'

}